Repository: jiya-talreja/multi_language_detection
Catalog: backend/input/opus/en-hi.tmx
Source language: en
Languages: hi

source: He intends to devote his life to curing the sick in India.
hi: वह अपनी ज़िंदगी को भारत में बीमारों का इलाज करने में समर्पित करना चाहता है।

source: He expressed his feelings for nature in a poem.
hi: उसने प्रकृति के प्रति अपनी भावनाओं को प्रकट किया।

source: He'll never admit to being in the wrong.
hi: वह कभी अपनी ग़लती नहीं मानेगा।

source: He explained his plans in detail.
hi: उसने विस्तृत रूप से अपनी योजना समझाई।

source: He set fire to his own house.
hi: उसने अपने ही घर को आग लगा दी।

source: He exhibited no remorse for his crime.
hi: उसको उसके जुर्म पर बिलकुल भी पछतावा नहीं था।

source: He is weary of his work.
hi: वह अपने काम से थक गया है।

source: He ascribes his failure to bad luck.
hi: उसने अपनी नाकामयाबी के लिए अपने बुरे नसीब को दोषी ठहराया।

source: He waited his turn.
hi: उसने अपनी बारी का इंतेज़ार किया।

source: He ought to have made allowances for his age.
hi: उसे अपनी उम्र के बारे में सोचना चाहिए था।

source: He had to reduce the price of his wares.
hi: उसे अपने सामान की कीमतें कम करनीं पड़ीं।

source: He repeated his name slowly.
hi: उसने अपना नाम दोबारा धीरे से बोला।

source: He saved my life at the risk of his own.
hi: उसने अपनी जान को जोखिम में डालकर मेरी जान बचाई।

source: He fitted his schedule to mine.
hi: उसने अपना कार्यक्रम मेरे अनुसार बदल लिया.

source: He used pigeons in his experiment.
hi: वह अपने प्रयोगों में कबूतरों का उपयोग करता था।

source: He cannot buy a car, still less a house.
hi: मकान की बात तो छोड़ो वह तो गाड़ी भी नहीं ख़रीद सकता।

source: He is accustomed to hard work.
hi: उसे मेहनत करने की आदत है।

source: He sent out the parcel the day before yesterday.
hi: उसने पार्सल को परसों भेजा था।

source: He will get better little by little.
hi: वह धीरे-धीरे ठीक हो जाएगा।

source: He reads ten books a month at least.
hi: वह महीने में कम-से-कम दस किताबें पढ़ता है।

source: He is always complaining about his boss.
hi: वह हमेशा अपने बॉस की शिकायत करता रहता है।

source: He is after a job.
hi: वह किसी नौकरी के पीछे पड़ा है।

source: He is indifferent to what he eats.
hi: उसे उसके खाने से फ़र्क नहीं पड़ता।

source: He is eating.
hi: वह खा रहा है।

source: He looked back and smiled at me.
hi: उसने पीछे मुड़कर मुझपर मुस्कुराया।

source: He wants a new car.
hi: उसे एक नयी गाड़ी चाहिए।

source: He went outside for a breath of fresh air.
hi: वह थोड़ी ताज़ा हवा खाने के लिए बाहर गया।

source: He peered at the small print in a newspaper.
hi: उसने अखबार के छोटे-छोटे अक्षरों को घूरा।

source: He ran away in the direction of the wood.
hi: वह जंगल की दिशा में भाग गया।

source: He breathed deeply.
hi: उसने गहरी साँस ली।

source: He could not breathe deeply.
hi: वह लम्बी सांस नहीं ले पाता था।

source: He accepted our offer.
hi: उसने हमारा प्रस्ताव स्वीकार कर लिया।

source: He tends to get angry when people oppose him.
hi: जब लोग उसके खिलाफ़ जातें हैं तो वह गुस्सा हो जाता है।

source: It is said that he is the richest man in the world.
hi: कहा जाता है कि वह दुनिया में सबसे अमीर आदमी है।

source: He wanted to succeed.
hi: वह कामयाब होना चाहता था।

source: He has no sense of right and wrong.
hi: वह सही-ग़लत में अंतर करना नहीं जानता।

source: He told the truth, otherwise he would have been punished.
hi: उसने सच बताया, वरना उसे सज़ा होती।

source: He is a sharp-shooter.
hi: उसका निशाना बहुत अच्छा है।

source: He has blue eyes and fair hair.
hi: उसकी नीली आखें हैं और गोरे बाल हैं।

source: He is not the cheerful man he was.
hi: वह पहले की तरह हँसमुख नहीं रहा।

source: He weighed the stone in his hand.
hi: उसने पत्थर को अपने हाथ में रखकर तोला।

source: He was respected both as a teacher and as a man.
hi: उसको दोनो एक अध्यापक और एक इनसान के रूप में सम्मान मिला।

source: He walked along the river.
hi: हमने नदी के किनारे सैर करी।

source: He betrayed his country.
hi: उसने अपने देश को धोखा दे दिया।

source: He did not get up early.
hi: वह जल्दी नहीं उठा।

source: He hammered at the window.
hi: उसने खिड़की पर ज़ोर लगाकर खटखटाया।

source: He came running.
hi: वह भागते हुए आया।

source: He left a large fortune to his son.
hi: उसने अपने बेटे के लिए बड़ी जायदाद छोड़ी।

source: He pulled his son by the ear.
hi: उसने अपने बेटे को कान से पकड़ कर खींचा।

source: He named his son James.
hi: उसने अपने बेटे का नाम जेम्स रखा।

source: He is coarse in manner.
hi: वह चाल-चलन में असभ्य है।

source: He got a lot of money.
hi: उसे बहुत सारा पैसा मिला।

source: He will be a doctor when he grows up.
hi: वह बड़ा होकर डॉक्टर बनना चाहता है।

source: He felt very lonely.
hi: उसे बहुत अकेलापन महसूस हुआ।

source: He was patience itself.
hi: वह स्वयं धैर्य की प्रतिमा था.

source: He made many costly purchases.
hi: उसने बहुत सी महंगी चीज़ें खरीदीं।

source: He believed that the earth was round.
hi: वह मानता था कि पृथ्वी गोल है।

source: They fined him 5,000 yen for illegal parking.
hi: उन्होंने उसपर गाड़ी ग़लत खड़ी करने के लिए पाँच हज़ार येन का जुर्माना लगाया।

source: He works on the farm from morning till night.
hi: वह खेत पर सुबह से शाम तक काम करता है।

source: He can't stay long.
hi: वह ज़्यादा देर के लिए नहीं रह सकता।

source: He lost no time answering the letter.
hi: उसने फटाफट चिट्ठी का जवाब दिया।

source: He was standing at the street corner.
hi: वह सड़क के किनारे पर खड़ा था।

source: He did well to accept the offer.
hi: उसने अच्छा किया कि उस नौकरी को हाँ कर दिया।

source: He couldn't check his anger.
hi: वह अपने गुस्से को काबू में नहीं रख पाया।

source: He was detected in the very act of stealing.
hi: उसको चोरी करते हुए पकड़ा गया।

source: He knows a lot about wild animals.
hi: वह जंगली जानवरों के बारे में बहुत कुछ जानता है।

source: He passed away quite suddenly.
hi: वह बिल्कुल अचानक से गुज़र गया।

source: He is familiar with Japanese culture.
hi: वह जापानी संस्कृति से परिचित है।

source: He went to India by way of Japan.
hi: वह जापान से होकर भारत गया।

source: He is not Japanese.
hi: वह जापानी नहीं है।

source: He's always at home on Sundays.
hi: रविवार को वह हमेशा घर पर ही होता है।

source: He looks like a horse.
hi: वह दिखने में घोड़े की तरह लगता है।

source: He is an actor.
hi: वह अभिनेता है।

source: Is he tall?
hi: क्या वह लंबा है?

source: He is tall and strong.
hi: वह लम्बा और ताकतवर है।

source: He is less impatient than his father.
hi: उसमें उसके पिता जितनी बेसब्री नहीं थी।

source: He ordered them to release the prisoners.
hi: उसने उनको क़ैदियों को छोड़ने का आदेश दिया।

source: He put a hand gently on her shoulder.
hi: उसने हल्के से उसके कंधे पर हाथ रखा।

source: He got angry with me.
hi: वह मुझपर गुस्सा हो गया।

source: He traded on her kindness.
hi: उसने उसके अच्छेपन का दुर्व्यवहार किया।

source: He slapped her.
hi: उसने उसे थप्पड़ मारी।

source: He helps her.
hi: वह उसकी मदत करता है।

source: He is very strong--so much so that no one can defeat him.
hi: वह अत्यंत बलवान है, इतना अधिक बलवान के उसे कोई पछाड़ नहीं सकता.

source: He hid his sadness behind a smile.
hi: उसने अपने दुख को अपनी मुस्कुराहट के पीछे छिपा लिया।

source: It is said that he is sick.
hi: कहा जाता है कि वह बीमार है।

source: He was absent from school on account of illness.
hi: वह बीमारी की वजह से स्कूल नहीं आया।

source: He could not join us because he was ill.
hi: वह बीमारी की वजह से हमारे साथ नहीं आ सका।

source: He jumped about the room.
hi: वह कमरे में कूद-फदक कर रहा था।

source: He jumped into the water clothes and all.
hi: उसने कपड़े उतारे बिना ही पानी में छलाँग लगादी।

source: He understands physics.
hi: वह भौतिक विज्ञान समझता है।

source: He is a physicist.
hi: वह भौतिक विज्ञानी है।

source: He went to China as a soldier, never to come back.
hi: वह सिपाही के रूप में चीन गया, और कभी लौटकर नहीं आया।

source: He has a hat on.
hi: उसने टोपी पहनी हुई है।

source: He never takes into account the fact that I am very busy.
hi: वह कभी भी इस बात का खयाल नहीं करता है कि मैं कितना व्यस्थ हूँ।

source: He leveled his gun at me.
hi: उसने अपनी बंदूक का निशाना मुझपर लगाया।

source: He pressed me for a prompt reply.
hi: उसने मुझसे जल्द-से-जल्द उत्तर देने के लिए कहा।

source: He robbed me of my bag.
hi: उसने मेरा बस्ता चुरा लिया।

source: He tore the book apart.
hi: उसने किताब को फाड़ डाला।

source: Is he reading a book?
hi: वह किताब पढ़ रहा है क्या?

source: He reads the paper every morning.
hi: वह हर सुबह अखबार पढ़ता है।

source: He walks his dog every morning.
hi: वह हर सुबह अपने कुत्ते को सैर पर ले जाता है।

source: He called me up almost every day.
hi: उसने लगभग रोज़ मुझे फ़ोन किया।

source: He plays baseball every day.
hi: वह हर रोज़ बेसबॉल खेलता है।

source: He seeks fame and wealth.
hi: वह दौलत और शोहरत की तलाश में है।

source: He is admittedly an able leader.
hi: यह मानना होगा कि वह एक योग्य मार्ग दर्शक है ।

source: He is coming to see me tomorrow afternoon.
hi: वह कल दोपहर मुझसे मिलने आ रहा है।

source: He was sleeping under the tree.
hi: वह पेड़ के नीचे सो रहा था।

source: He closed his eyes.
hi: उसने अपनी आँखें बंद करीं।

source: He runs a company in Meguro.
hi: वह मेगुरो में एक कंपनी चलाता है।

source: He borrowed money from his friend.
hi: उसने अपने मित्र से पैसे उधार लिए।

source: He is a famous merchant.
hi: वह एक मशहूर व्यापारी है।

source: He did not show up at the party last night.
hi: वह कल पार्टी में नहीं आया।

source: He turned traitor.
hi: वह देशद्रोही बन गया।

source: He lives with his parents.
hi: वह अपने माता-पिता के साथ रहता है।

source: It is said that she is a good cook.
hi: कहते हैं की वह अच्छी बावर्ची है।

source: He went mad when he heard the story.
hi: वह कहानी सुन कर पागल हो गया।

source: He tends to be arrogant.
hi: उसको घमण्डी होने की आदत है।

source: Nobody is cleverer than he.
hi: उससे चतुर कोई नहीं है।

source: Both he and his wife have cars.
hi: वह और उसकी पत्नी दोनो के पास गाड़ियाँ हैं।

source: It's important for them to go out.
hi: उनके लिए बाहर जाना बहुत ज़रूरी है।

source: I haven't seen them anywhere.
hi: मैने उसे कहीं भी नहीं देखा है।

source: Their conversation was carried on for about an hour.
hi: उनकी बातचीत लगभग एक घंटे तक चलती रही।

source: Their wedding will be tomorrow.
hi: उनकी शादी कल होगी।

source: I will have to help them.
hi: मुझे उनकी मदद करनी पड़ेगी।

source: Their son's name is John.
hi: उनके बेटे का नाम जॉन है।

source: All their efforts were in vain.
hi: उनकी सारी कोशिश व्यर्थ हो गयी थी.

source: Their manners and customs are different from those of this country.
hi: उनके रीति-रिवाज़ इस देश के से अलग हैं।

source: Their conversation being in Chinese, I did not understand one word.
hi: उनकी बातचीत चीनी में होने के कारण में एक शब्द भी नहीं समझा।

source: They are both good teachers.
hi: वे दोनों अच्छे अध्यापक हैं।

source: Now they have three children.
hi: अब उनके तीन बच्चे हैं।

source: They live in a little village in England.
hi: वे इंग्लैंड के एक छोटे से गाँव में रहते हैं।

source: They looked at each other.
hi: उन्होंने एक-दूसरे को देखा।

source: They will fall in love with each other.
hi: उन्हें एक-दूसरे से प्यार हो जाएगा।

source: They named the dog Shiro.
hi: उन्होंने कुत्ते का नाम 'शिरो' रखा।

source: They adopted the orphan.
hi: उन्होंने अनाथ बच्चे को गोद ले लिया।

source: They missed the train.
hi: उनकी ट्रेन छूट गई।

source: They went out of sight at last.
hi: वे आखिरकार नज़र से बाहर निकल गए।

source: They wanted to get married as soon as they could.
hi: वे जल्द-से-जल्द शादी करना चाहते थे।

source: They will be very glad.
hi: वे बहुत प्रसन्न होंगे।

source: They gave us very little trouble.
hi: उन्होंने हमको बहुत कम कष्ट दिया।

source: Each of them has a bicycle.
hi: उन सभी के पास साईकल है।

source: They resolved to work harder.
hi: उन्होंने ज़्यादा मेहनत से काम करने का इरादा किया।

source: They have gone to Europe.
hi: वे युरोप गये हैं।

source: They are talking about music.
hi: वे संगीत के बारे में बात कर रहे हैं।

source: They went on talking for hours.
hi: उन्होंने और कुछ घंटों के लिए बातचीत करी।

source: They abandoned their country.
hi: उन्होंने अपने देश को त्याग दिया।

source: They have tea at five.
hi: वे पाँच बजे चाय पीते हैं।

source: They must have made a mistake.
hi: उनसे ग़लती हो गई होगी।

source: They stood face to face.
hi: वे आमने-सामने खड़े हुए।

source: They were scattered in all directions.
hi: वे सारी दिशाओं में फैले हुए थे।

source: They have full confidence in their leader.
hi: उन्हें अपने लीडर पर पूरा भरोसा है।

source: They brought trouble on themselves.
hi: उन्होंने अपने ऊपर मुसीबत बुलाई।

source: They have no house to live in.
hi: उनके पास रहने के लिए कोई घर नहीं है।

source: They shouted for help.
hi: उन्होंने मदद के लिए चिल्लाया।

source: They are willing to learn English.
hi: वे अंग्रेज़ी सीखने को तैयार हैं।

source: They furnished the library with many books.
hi: उन्होंने पुस्तकालय को बहुत सारी किताबें दीं।

source: They fought in the cause of justice.
hi: वे न्याय के निमित्त से लड़े।

source: They are in favor of the reform of the tax laws.
hi: वे टैक्स सुधार क़ानून के पक्ष में हैं।

source: They were scolded by the teacher.
hi: उन्हें अपनी टीचर से डाँट पड़ी।

source: Are they in the gym?
hi: वे जिमखाने में हैं क्या?

source: They gathered in the gym.
hi: वे सब जिमखाने में मिले।

source: They worked hard from morning till night.
hi: वे सुबह से ले कर रात तक कड़ी मेहनत करते थे।

source: They abandoned the sinking ship.
hi: उन्होंने डूबते हुए जहाज़ को छोड़ दिया।

source: They are not enemies, but friends.
hi: वे शत्रु नहीं बल्कि मित्र हैं।

source: They were caught in a shower on the way.
hi: वे रास्ते में बारिश में फँस गए।

source: They obtained a yield of 8 percent on their investment.
hi: उनके इनवेस्टमेंट पर ८ प्रतिशत का फ़ायदा हुआ।

source: They are proud of their clever son.
hi: उन्हे अपने अकलमंद बेटे पर नाज़ है।

source: They went to the zoo.
hi: वे ज़ू गए थे।

source: Are they Japanese or Chinese?
hi: वे जापानी हैं या चीनी?

source: He cannot answer their questions.
hi: वह उनके सवालों का जवाब नहीं दे सकता।

source: They consider him intelligent.
hi: वे उसे समझदार मानते हैं।

source: They booted him out of school for not studying.
hi: कयोंकि वह पढ़ाई नहीं करता था, उसे स्कूल से निकाल दिया गया।

source: They looked on her behavior as childish.
hi: उनकी आँखों में उसका बर्ताव बच्चे जैसा था।

source: They went out of the room, one after another.
hi: वे एक-एक कर के कमरे से बाहर गयें।

source: They dug here and there for treasure.
hi: उन्होंने ख़ज़ाना ढूँढने के लिए यहाँ-वहाँ खोदा।

source: They will get married next month.
hi: उनकी शादी अगले महीने होगी।

source: They believe that the soul is immortal.
hi: वह मानते हैं कि आत्मा अमर होती है।

source: Don't make fun of them.
hi: उनका मज़ाक मत उड़ाओ।

source: Although they are twins, they have few interests in common.
hi: वे हालांकि जुड़वा हैं, उनके शोक एक-दूसरे से बहुत अलग हैं।

source: I inquired after him.
hi: मैं उसके बारे में पूछ-ताछ की।

source: There's no use trying to persuade him.
hi: उसको मनाने की कोशिश करने में कोई फ़ायदा नहीं है।

source: Bring him in.
hi: उसको अंदर ले आओ।

source: I don't know when she will leave for London.
hi: मुझे नहीं पता वह लंदन के लिए रवाना कब होएगी।

source: Do you remember what she said?
hi: तुम्हें याद है उसने क्या कहा था?

source: I don't know if she will go there with me.
hi: मुझे नहीं पता वह मेरे साथ वहाँ जाएगी कि नहीं।

source: I do not know for certain what she is going to do.
hi: मुझे ठीक से नहीं पता वह क्या करने वाली है।

source: I found out where she was.
hi: मुझे पता लगा कि वह कहाँ थी।

source: Are you sure of her coming on time?
hi: तुम्हे पक्का मालूम है कि वह समय पर आ रही है?

source: It is necessary that she should go herself.
hi: उसका अकेला जाना ज़रूरी है।

source: She can only trust him.
hi: वह उसी पर भरोसा कर सकती है।

source: I don't know if she will come.
hi: मुझे नहीं पता कि वह आएगी कि नहीं।

source: I will be able to marry her.
hi: मैं उसके साथ शादी कर सकूँगा।

source: I have seen her three times.
hi: मैंने उसे तीन बार देखा है।

source: I tried to give her some money, but she wouldn't take any.
hi: मैंने उसको पैसे देने की कोशिश करी पर उसने इनकार कर दिया।

source: I know nothing about her.
hi: मैं उसके बारे में कुछ नहीं जानता।

source: She has a son, who became a doctor.
hi: उसके पास एक बेटा है, और वह डॉक्टर बन गया है।

source: She had plenty of acquaintances, but no friends.
hi: उसकी जान-पहचान में तो बहुत लोग थे पर दोस्त कोई भी नहीं थे।

source: I motioned for her to sit down.
hi: मैंने उससे बैठ जाने का इशारा किया।

source: I saw her again.
hi: मैंने उसे फिरसे देखा।

source: I wanted her to win.
hi: मैं चाहता था कि वह जीत जाए।

source: I fell in love with her.
hi: मुझे उससे प्यार हो गया।

source: It appears that her injury was pretty bad.
hi: ऐसा लगता है की उसे बहुत ही बुरी बाधा हुई है.

source: She is a woman of great beauty.
hi: वह एक बहुत ही खूबसूरत औरत है।

source: Her only interest is the accumulation of money.
hi: उसको एक ही काम से दिलचस्पी है, और वह है पैसा इकट्ठा करना।

source: If it had not been for her help, you would never have done it.
hi: उसकी मदद के बिना तुम नहीं कर पाते।

source: She gave me a large room while I stayed at her house.
hi: जब मैं उसके घर पर रही, उसने मुझे रहने के लिए एक बड़ा सा कमरा दिया।

source: I know her by sight, but I've never spoken to her.
hi: मैं उसे पहचानता हूँ पर मैंने उससे कभी बात नहीं करी है।

source: Don't be taken in by her crocodile tears.
hi: उसके झूठ-मूठ के रोने पर यकीन मत कर लेना।

source: What she says sounds strange.
hi: उसकी कही हुई बात अजीब लगती है।

source: If I had known her address, I would have written to her.
hi: अगर मुझे उसका पता पता होता, तो मैंने उसे चिट्ठी लिखी हुई होती।

source: I know her address.
hi: मुझे उसका पता पता है।

source: I like the way she smiles.
hi: मुझे उसकी मुस्कान अच्छी लगती है।

source: Her new hat becomes her.
hi: उसकी नई टोपी उसपर जँचती है।

source: He was happy at the news of her success.
hi: वह उसकी कामयाबी की खबर सुनकर खुश था।

source: Her advice to me was to work harder.
hi: उसकी मेरे लिए सलाह यह थी कि मैं ज़्यादा मन लगाकर काम करूँ।

source: Her father is Japanese.
hi: उसके पिता जापानी हैं।

source: Her story can't be true.
hi: उसकी कहानी सच्ची नहीं हो सकती।

source: Her mother was busy cooking the dinner.
hi: उसकी माँ खाना बनाने में लगी हुई थी।

source: Her eyes are laughing.
hi: उसकी आँखें हँस रहीं हैं।

source: Her way of talking got on my nerves.
hi: उसके बात करने के तरीके पर मुझे खींज आती है।

source: He is not coming, according to her.
hi: उसके हिसाब से, वह नहीं आ रहा।

source: Her story brought back our happy childhood.
hi: उसकी कहानी ने मुझे हमारे बच्चेपन की खुशहाली याद दिलाई।

source: Her story can't be true. She often tells lies.
hi: उसकी कहानी सच्ची नहीं हो सकती। वह अक्सर झूठ बोलती है।

source: She realized her ambition to be an actress.
hi: उसकी अभिनेत्री बनने की अभिलाषा सच हो गई।

source: She will give her picture to whoever wants it.
hi: वह अपनी तस्वीर जो भी चाहे उसको दे देगी।

source: She saved a hundred dollars.
hi: उसने सौ डॉलर बचा लिए।

source: She thought for a few minutes.
hi: उसने कुछ मिनटों के लिए सोचा।

source: She will become a doctor in two years.
hi: वह दो सालों में डॉक्टर बन जाएगी।

source: She is two years senior to you.
hi: वह तुमसे दो साल से बड़ी है।

source: She speaks a little Arabic.
hi: वह थोड़ी सी अरबी बोलती है।

source: How long has she been sick?
hi: वह कितने दिनों से बीमार है?

source: She always works hard.
hi: वह हमेशा मन लगाकर काम करती है।

source: She always tries something new.
hi: वह हमेशा कोई नया काम आज़माती रहती है।

source: She is always dressed in black.
hi: वह हमेशा काले कपड़े पहनती है।

source: She always smiles at me.
hi: वह हमेशा मेरी तरफ़ मुस्कुराती है।

source: She is well known in both India and China.
hi: वह भारत और चीन दोनो में बहुत प्रसिद्ध है।

source: She is living in some village in India.
hi: वह भारत के किसी गाँव में रह रही है।

source: She smiled happily.
hi: उसने खुशी से मुस्कुराया।

source: I'm fed up with her chatter.
hi: मैं उसकी बकबक से तंग आ गया हूँ।

source: She was brought up by her grandmother.
hi: उसकी दादी ने उसे पाल-पोस कर बड़ा किया था।

source: She married a rich man.
hi: उसने पैसेवाले से शादी की।

source: She was making tea.
hi: वह चाय बना रही थी।

source: She cut the cake into six pieces and gave one to each of the children.
hi: उसने केक को छः टुकड़ो में काट कर, हर बच्चे हो एक टुकड़ा दिया।

source: She is in a mood.
hi: वह भाव खा रही है।

source: I'm sure that she will come back soon.
hi: मुझे यकीन है कि वह जल्द ही वापस आ जाएगी।

source: She burst into tears when she heard the news.
hi: वह खबर सुनते ही रो पड़ी।

source: When she was reading the letter, she looked sad.
hi: वह चिट्ठी पढ़ने के समय दुखी लग रही थी।

source: She declined the invitation.
hi: उसने आमंत्रण को स्वीकार नहीं किया।

source: She chose the red dress.
hi: उसने लाल ड्रेस चुनी।

source: She is familiar with the subject.
hi: वह इस विषय से परिचित है।

source: She didn't want to speak to anyone.
hi: उसे किसी से भी बात करने का मन नहीं था।

source: She poured coffee into the cups on the table.
hi: उसने मेज़ पर रखे हुए कपों में कॉफ़ी डाली।

source: She plays tennis very well.
hi: वह टेनिस बहुत अच्छा खेलती है।

source: She loves watching tennis matches on TV.
hi: उसे टीवी पर टेनिस देखना बहुत पसंद है।

source: She is very pretty.
hi: वह बहुत सुंदर है।

source: She cooked us a wonderful meal.
hi: उसने हमारे लिए बहुत ही शानदार भोजन तैयार किया।

source: She is a very good teacher.
hi: वह बहुत अच्छी अध्यापिका है.

source: She is very careful, so she seldom makes mistakes.
hi: वह बहुत ध्यानपूर्वक है, इसलिए बहुत कम ग़लतियाँ करती है।

source: She married Tom last month.
hi: उसने पिछले महीने टॉम से शादी करी थी।

source: She did not say anything.
hi: उसने कुछ नहीं कहा।

source: She was heard playing the violin.
hi: वह विओलिन बजाती सुनाई दी.

source: She bought two pounds of butter.
hi: उसने एक किलो मक्खन खरीदा।

source: She has gone to Paris.
hi: वह पेरिस गई है।

source: She left for Paris.
hi: वह पेरिस के लिए रवाना हो गई।

source: She bought a handbag, but she lost it the next day.
hi: उसने नयी हैंडबैग खरीदी, मगर अगले ही दिन वह खो बैठी।

source: She can speak French, and fluently at that.
hi: वह फ़्रानसीसी बोल सकती है, और बहुत धड़ल्ले से बोलती है।

source: She is my girlfriend.
hi: वह मेरी गर्लफ़्रेंड है।

source: She will be back before long.
hi: वह थोड़ी देर में ही वापस आ जाएगी।

source: She has not come here yet.
hi: वह अभी तक यहाँ नहीं आई है।

source: She believes her son is still alive.
hi: उसको लगता है कि उसका बेटा अभी भी ज़िंदा है।

source: She did it all by herself.
hi: उसने सब कुछ अपने-आप किया।

source: She talks as if she knew everything.
hi: वह तो ऐसे बात करती है जैसे उसे सब कुछ पता हो।

source: She has already finished the work.
hi: वह काम खतम कर चुकी है।

source: She talks a lot.
hi: वह बहुत बोलती है।

source: She is an obstinate girl.
hi: वह एक ज़िद्दी लड़की है।

source: She has worn the same hat for a month.
hi: उसने एक महीने से वही टोपी पहन रखी है.

source: She lives in an apartment alone.
hi: वह फ़्लैट में अकेले रहती है।

source: She remained single all her life.
hi: उसने पूरी ज़िन्दगी शादी नहीं करी।

source: She suddenly became famous.
hi: वह अचानक से मशहूर बन गई।

source: She is capable of teaching both English and French.
hi: उसके पास अंग्रेज़ी और फ़्रांसीसी सिखाने की काबिलियत है।

source: She has a rich vocabulary of English words.
hi: उसको बहुत सारे अंग्रेज़ी शब्द आते हैं।

source: She went to America for the purpose of studying English literature.
hi: वह अंग्रेज़ी साहित्य का अध्ययन करने के इरादे से अमरीका गई।

source: She has a clean heart.
hi: उसका दिल साफ़ है।

source: She went to Paris to study music.
hi: वह संगीत पढ़ने के लिए पैरिस गई।

source: She began to sing.
hi: वह गाने लगी।

source: She looked at the picture.
hi: उसने तस्वीर को देखा।

source: She had her bag snatched.
hi: उससे उसका बस्ता छीन लिया गया।

source: She dialed the wrong number.
hi: उसने गलत नम्बर मिला डाला।

source: She gladly accepted his proposal.
hi: उसने उसका प्रस्ताव खुशी से स्वीकार कर लिया।

source: She knew the story already.
hi: उसको कहानी पहले से ही पता थी।

source: She is a wealthy woman.
hi: वह बहुत पैसेवाली औरत है।

source: She married a rich old man.
hi: उसने अमीर बूड़े से शादी कर ली.

source: She isn't married.
hi: वह शादीशुदा नहीं है।

source: She forgot to feed her dog.
hi: वह अपने कुत्ते को खिलाना भूल गई।
